Ran Plan for dir: `infra` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "demo-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "eks" {
      + id    = (known after apply)
      + name  = "demo-cluster"
      + token = (sensitive value)
    }

  # data.kubernetes_service.atlantis will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "atlantis" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "atlantis"
          + namespace        = "atlantis"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # data.template_file.atlantis_values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "atlantis_values" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            github:
              user: "${GITHUB_USER}"
            
            vcsSecretName: ${VCS_SECRET_NAME}
            
            orgAllowlist: github.com/${GITHUB_USER}/*
            
            serviceAccount:
              create: true
              name: atlantis
              annotations:
                eks.amazonaws.com/role-arn: "${ATLANTIS_ROLE_ARN}"
            
            service:
              type: LoadBalancer
              port: 80
              annotations:
                service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
                service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
                service.beta.kubernetes.io/aws-load-balancer-type: "classic"
            
            ingress:
              enabled: false
            
            volumeClaim:
              enabled: true
              dataStorage: 5Gi
              storageClassName: gp2
              accessModes: ["ReadWriteOnce"]
        EOT
      + vars     = {
          + "ATLANTIS_ROLE_ARN" = "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
          + "GITHUB_USER"       = "ed-bogd"
          + "VCS_SECRET_NAME"   = (sensitive value)
        }
    }

  # aws_iam_access_key.eks_read_only will be created
+ resource "aws_iam_access_key" "eks_read_only" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eks-read-only-user"
    }

  # aws_iam_user.eks_read_only will be created
+ resource "aws_iam_user" "eks_read_only" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eks-read-only-user"
      + path          = "/"
      + tags          = {
          + "Name" = "eks-read-only"
        }
      + tags_all      = {
          + "Name" = "eks-read-only"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.eks_read_only_assume_role will be created
+ resource "aws_iam_user_policy" "eks_read_only_assume_role" {
      + id          = (known after apply)
      + name        = "eks-read-only-assume-role"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::743683883645:role/eks-read-only"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eks-read-only-user"
    }

  # helm_release.atlantis will be updated in-place
~ resource "helm_release" "atlantis" {
        id                         = "atlantis"
      ~ metadata                   = [
          - {
              - app_version    = "v0.34.0"
              - chart          = "atlantis"
              - first_deployed = 1748239992
              - last_deployed  = 1748239992
              - name           = "atlantis"
              - namespace      = "atlantis"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                         NOTE: It may take a few minutes for the LoadBalancer IP to be available.
                               You can watch the status of by running 'kubectl get svc -w atlantis'
                      export SERVICE_IP=$(kubectl get svc --namespace atlantis atlantis -o jsonpath='{.status.loadBalancer.ingress[0].ip}')
                      echo http://$SERVICE_IP:80
                    2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                      - github
                      - githubApp
                      - gitea
                      - gitlab
                      - bitbucket
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - github         = {
                          - user = "ed-bogd"
                        }
                      - ingress        = {
                          - enabled = false
                        }
                      - orgAllowlist   = "github.com/ed-bogd/*"
                      - service        = {
                          - annotations = {
                              - "service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled" = "true"
                              - "service.beta.kubernetes.io/aws-load-balancer-scheme"                            = "internet-facing"
                              - "service.beta.kubernetes.io/aws-load-balancer-type"                              = "classic"
                            }
                          - port        = 80
                          - type        = "LoadBalancer"
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                            }
                          - create      = true
                          - name        = "atlantis"
                        }
                      - vcsSecretName  = "atlantis-vcs"
                      - volumeClaim    = {
                          - accessModes      = [
                              - "ReadWriteOnce",
                            ]
                          - dataStorage      = "5Gi"
                          - enabled          = true
                          - storageClassName = "gp2"
                        }
                    }
                )
              - version        = "5.17.2"
            },
        ] -> (known after apply)
        name                       = "atlantis"
      ~ values                     = [
          - <<-EOT
                github:
                  user: "ed-bogd"
                
                vcsSecretName: atlantis-vcs
                
                orgAllowlist: github.com/ed-bogd/*
                
                serviceAccount:
                  create: true
                  name: atlantis
                  annotations:
                    eks.amazonaws.com/role-arn: "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                
                service:
                  type: LoadBalancer
                  port: 80
                  annotations:
                    service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
                    service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
                    service.beta.kubernetes.io/aws-load-balancer-type: "classic"
                
                ingress:
                  enabled: false
                
                volumeClaim:
                  enabled: true
                  dataStorage: 5Gi
                  storageClassName: gp2
                  accessModes: ["ReadWriteOnce"]
            EOT,
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # kubernetes_secret.atlantis_vcs[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "kubernetes_secret" "atlantis_vcs" {
      - binary_data_wo                 = (write-only attribute) -> null
      - data                           = (sensitive value) -> null
      - data_wo                        = (write-only attribute) -> null
      - id                             = "atlantis/atlantis-vcs" -> null
      - immutable                      = false -> null
      - type                           = "Opaque" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atlantis-vcs" -> null
          - namespace        = "atlantis" -> null
          - resource_version = "6300" -> null
          - uid              = "098f8d6c-f538-421f-a04d-319c2667f12a" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.eu-central-1.amazonaws.com/id/73B240B8674237A959FA38EF17BF2048"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-central-1:743683883645:access-entry/demo-cluster/root/743683883645//72cb8591-df08-b149-341e-a1826d7e9d7b" -> (known after apply)
      ~ created_at        = "2025-05-26T05:49:41Z" -> (known after apply)
      ~ id                = "demo-cluster:arn:aws:iam::743683883645:root" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-05-26T05:49:41Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role" # forces replacement
        tags              = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
      ~ user_name         = "arn:aws:iam::743683883645:root" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-05-26 05:49:42.069 +0000 UTC" -> (known after apply)
      ~ id            = "demo-cluster#arn:aws:iam::743683883645:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-05-26 05:49:42.069 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.44.0-eksbuild.1" -> (known after apply)
        id                          = "demo-cluster:aws-ebs-csi-driver"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.11.4-eksbuild.14" -> (known after apply)
        id                          = "demo-cluster:coredns"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.32.3-eksbuild.7" -> (known after apply)
        id                          = "demo-cluster:kube-proxy"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.19.5-eksbuild.3" -> (known after apply)
        id                          = "demo-cluster:vpc-cni"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
~ resource "aws_eks_cluster" "this" {
        id                            = "demo-cluster"
        name                          = "demo-cluster"
        tags                          = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = (sensitive value)
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::743683883645:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/73B240B8674237A959FA38EF17BF2048"
        tags            = {
            "Environment" = "dev"
            "Name"        = "demo-cluster-eks-irsa"
            "Project"     = "atlantis-demo"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
~ resource "aws_kms_key" "this" {
        id                                 = "1cc62486-c4a4-4849-9282-437135ab66b5"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:role/demo-cluster-cluster-20250526053213135300000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 5 to add, 8 to change, 3 to destroy.

Changes to Outputs:
~ atlantis_url                = "ad24ffb4b2c794118a21fc9a9ccacd62-775947510.eu-central-1.elb.amazonaws.com" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=ed-bogd%252Fdevops-task%252Finfra%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra
  ```
Plan: 5 to add, 8 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```